$(document).ready(function(){
  // инициализация списка лотов
  var rewards = [
    new RewardCard(
      'images/chair.jpg',
      'Уникальный стул',
      'Одна из лучших вещей для того, что бы украсить свой дом и сделать его непохожим на другие.',
      '120',
      null,
      'Июль',
      '2020',
      'Некоторые страны'
    ),
    new RewardCard(
      'images/candle.jpeg',
      'Свечи',
      'Они создадут незабываемую атмосферу сказки и чудес и подарят вам счастье и тепло, которое не погаснет многие вечера и будет согревать вас.',
      '20',
      12,
      'Июль',
      '2020',
      'Некоторые страны'
    ),
    new RewardCard(
      'images/notebook.jpg',
      'Записная книга для тех кто много пишет',
      'Для тех, кто ценит свое время, эта вешь будет незаменимой находкой и поможет нашему проекту.',
      '25',
      68,'Июль',
      '2020',
      'Некоторые страны'
    ),
    new RewardCard(
      'images/pen.jpeg',
      'Сувенирная ручка',
      'Эта ручка будет выделять вас из толпы своим классическим стилем.',
      '13',
      47,'Июль',
      '2020',
      'Некоторые страны'
    )
  ]

  // добавление в разметку
  for (let i = 0; i < rewards.length; i++) {
    rewards[i].AddPayReward('#reward-box');
  }

  // развернуть/свернуть описание
  $('.show-description-btn').on('click', function(){
    let description = $(this).prev();
    if(description.css('display') == 'none'){
      description.slideDown(200);
      $(this).text('Свернуть');
    }
    else{
      description.slideUp(200);
      $(this).text('Развернуть описание');
    }
  })
})